# GroupAttachedParentName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GroupAttachedParentName Property
ParameterTypeId Class See Also
---
"Attached to"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GroupAttachedParentName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupAttachedParentName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GroupAttachedParentName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace